In [2]:
import pandas as pd
df=pd.read_csv(r'C:\Users\1000204905\Desktop\Pandas-challenge\Heroes.csv',encoding='latin-1')

In [5]:
df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [18]:
#Total number of players
players=len(df["SN"].value_counts())

#Unique items number
items =len(df['Item ID'].unique())

total_players=pd.DataFrame({'Total players':[players]})
total_players

   Total players
0            576

In [14]:
#Average purchase price
price=df['Price'].mean()
price

3.050987179487176

In [17]:
#Total Number of Purchases
purchase =len(df['Purchase ID'].unique())

#Total Revenue
revenue=df['Price'].sum()

summary=pd.DataFrame({"Number of unique items":[items],"Average Price":[price],"Number of purchases":[purchase],"Total Revenue":[revenue]})
summary

   Number of unique items  Average Price  Number of purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [80]:
#Purchase Count
gender_purchase=df.groupby(['Gender']).count()
gender_purchase_count=gender_purchase.iloc[:,1]

#Average Purchase Price
gender=df.groupby(['Gender']).mean()
gender_aver=gender.iloc[:,3]

#Total Purchase Value
gender2=df.groupby(['Gender']).sum()
gender_sum=gender2.iloc[:,3]

#Average Purchase Total per Person by Gender

gender3=gender_aver/gender_purchase_count

concat=pd.concat([gender_purchase_count,gender_aver],axis=1)
concat2=concat.rename(columns={'SN': "Purchase Count", 'Price': "Average Purchase Price"})
concat3=pd.concat([concat2,gender_sum],axis=1)
final_concat=concat3.rename(columns={'Price': "Total Purchase Value"})
final_concat

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [139]:
#Age Demographics

#The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
bins=[0,9.9,14,19,24,29,34,39,45]
labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","+40"]

#Purchase Count
ages_count=df.groupby(["Ages"]).count()
ages_count_fin=ages_count.iloc[:,2]

#Average Purchase Price
ages_avr=df.groupby(["Ages"]).mean()
ages_avr_fin=ages_avr.iloc[:,3] #Average purchase price

#Total Purchase Value
ages_sum=df.groupby(["Ages"]).sum()
ages_sum_fin=ages_sum.iloc[:,3] #Total Purchase Value


#Average Purchase Total per Person by Age Group

concat_ages=pd.concat([ages_count_fin,ages_avr_fin],axis=1)
concat_ages_fin=concat_ages.rename(columns={'Age':'Purchase Count','Price':'Average Purchase Price'})
concat_ages2=pd.concat([concat_ages_fin,ages_sum_fin],axis=1)
final_ages=concat_ages2.rename(columns={'Price':'Total Purchase Value'})
final_ages

       Purchase Count  Average Purchase Price  Total Purchase Value
Ages
<10                23                3.353478                 77.13
10-14              28                2.956429                 82.78
15-19             136                3.035956                412.89
20-24             365                3.052219               1114.06
25-29             101                2.900990                293.00
30-34              73                2.931507                214.00
35-39              41                3.601707                147.67
+40                13                2.941538                 38.24

In [218]:
### Top Spenders

#Identify the the top 5 spenders in the game by total purchase value, then list (in a table):
#Purchase Count
#Average Purchase Price

spenders_count=df.groupby("SN")["Purchase ID"].count()
spenders_count.nlargest(10)

spenders_sum=df.groupby('SN')['Price'].sum()
spenders_sum.nlargest(10)

spenders_ave=df.groupby('SN')['Price'].mean()

concat_spenders=pd.concat([spenders_count,spenders_sum],axis=1)
final_spenders=concat_spenders.rename(columns={'Purchase ID':'Purchase count','Price':'Total Purchase Value'})
concat_ultimate=pd.concat([final_spenders,spenders_ave],axis=1)
spenders_final_tab=concat_ultimate.rename(columns={'Price':'Average Purchase Price'})
spenders_final_tab.nlargest(5,'Total Purchase Value')

             Purchase count  Total Purchase Value  Average Purchase Price
SN
Lisosia93                 5                 18.96                3.792000
Idastidru52               4                 15.45                3.862500
Chamjask73                3                 13.83                4.610000
Iral74                    4                 13.62                3.405000
Iskadarya95               3                 13.10                4.366667

In [104]:
#Most Popular Items

#Identify the 5 most popular items by purchase count, then list (in a table):
items_count=df.groupby(['Item Name']).count()
items_count=items_count.nlargest(5,'Price').iloc[:,4]

#Item ID
itemsid_count=df.groupby(['Item ID']).count()
itemsid_count=itemsid_count.nlargest(5,'Price').iloc[:,4]
itemsid_count
#Item Name
#Purchase Count
#Item Price
#Total Purchase Value

Item ID
178    12
82      9
108     9
145     9
19      8
Name: Item Name, dtype: int64

In [262]:
#Most Profitable Items

#Identify the 5 most profitable items by total purchase value, then list (in a table):

profitable_count=df.groupby("Item Name")['Purchase ID'].count()

profitable_sum=df.groupby("Item Name")['Price'].sum()

profitable_table=pd.concat([profitable_count,profitable_sum],axis=1)
profitable_table.rename(columns={'Purchase ID':'Purchase Count','Price':'Total'})
profitable_table.nlargest(5,columns='Price')

                                              Purchase ID  Price
Item Name
Final Critic                                           13  59.99
Oathbreaker, Last Hope of the Breaking Storm           12  50.76
Nirvana                                                 9  44.10
Fiery Glass Crusader                                    9  41.22
Singed Scalpel                                          8  34.80